7767517
149 165
Input            input                    0 1 input
Convolution      392                      1 1 input 392 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
Clip             394                      1 1 392 394 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 395                      1 1 394 395 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             397                      1 1 395 397 0=0.000000e+00 1=6.000000e+00
Convolution      398                      1 1 397 398 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      400                      1 1 398 400 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Clip             402                      1 1 400 402 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 403                      1 1 402 403 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             405                      1 1 403 405 0=0.000000e+00 1=6.000000e+00
Convolution      406                      1 1 405 406 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_0              1 2 406 406_splitncnn_0 406_splitncnn_1
Convolution      408                      1 1 406_splitncnn_1 408 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             410                      1 1 408 410 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 411                      1 1 410 411 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             413                      1 1 411 413 0=0.000000e+00 1=6.000000e+00
Convolution      414                      1 1 413 414 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         416                      2 1 406_splitncnn_0 414 416 0=0
Split            splitncnn_1              1 2 416 416_splitncnn_0 416_splitncnn_1
Convolution      417                      1 1 416_splitncnn_1 417 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             419                      1 1 417 419 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 420                      1 1 419 420 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             422                      1 1 420 422 0=0.000000e+00 1=6.000000e+00
Convolution      423                      1 1 422 423 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_2              1 2 423 423_splitncnn_0 423_splitncnn_1
Convolution      425                      1 1 423_splitncnn_1 425 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             427                      1 1 425 427 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 428                      1 1 427 428 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             430                      1 1 428 430 0=0.000000e+00 1=6.000000e+00
Convolution      431                      1 1 430 431 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         433                      2 1 423_splitncnn_0 431 433 0=0
Split            splitncnn_3              1 2 433 433_splitncnn_0 433_splitncnn_1
Convolution      434                      1 1 433_splitncnn_1 434 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             436                      1 1 434 436 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 437                      1 1 436 437 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             439                      1 1 437 439 0=0.000000e+00 1=6.000000e+00
Convolution      440                      1 1 439 440 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         442                      2 1 433_splitncnn_0 440 442 0=0
Split            splitncnn_4              1 2 442 442_splitncnn_0 442_splitncnn_1
Convolution      443                      1 1 442_splitncnn_1 443 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             445                      1 1 443 445 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 446                      1 1 445 446 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             448                      1 1 446 448 0=0.000000e+00 1=6.000000e+00
Convolution      449                      1 1 448 449 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_5              1 2 449 449_splitncnn_0 449_splitncnn_1
Convolution      451                      1 1 449_splitncnn_1 451 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             453                      1 1 451 453 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 454                      1 1 453 454 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             456                      1 1 454 456 0=0.000000e+00 1=6.000000e+00
Convolution      457                      1 1 456 457 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         459                      2 1 449_splitncnn_0 457 459 0=0
Split            splitncnn_6              1 2 459 459_splitncnn_0 459_splitncnn_1
Convolution      460                      1 1 459_splitncnn_1 460 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             462                      1 1 460 462 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 463                      1 1 462 463 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             465                      1 1 463 465 0=0.000000e+00 1=6.000000e+00
Convolution      466                      1 1 465 466 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         468                      2 1 459_splitncnn_0 466 468 0=0
Split            splitncnn_7              1 2 468 468_splitncnn_0 468_splitncnn_1
Convolution      469                      1 1 468_splitncnn_1 469 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             471                      1 1 469 471 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 472                      1 1 471 472 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             474                      1 1 472 474 0=0.000000e+00 1=6.000000e+00
Convolution      475                      1 1 474 475 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         477                      2 1 468_splitncnn_0 475 477 0=0
Convolution      478                      1 1 477 478 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             480                      1 1 478 480 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 481                      1 1 480 481 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             483                      1 1 481 483 0=0.000000e+00 1=6.000000e+00
Convolution      484                      1 1 483 484 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_8              1 2 484 484_splitncnn_0 484_splitncnn_1
Convolution      486                      1 1 484_splitncnn_1 486 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             488                      1 1 486 488 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 489                      1 1 488 489 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             491                      1 1 489 491 0=0.000000e+00 1=6.000000e+00
Convolution      492                      1 1 491 492 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         494                      2 1 484_splitncnn_0 492 494 0=0
Split            splitncnn_9              1 2 494 494_splitncnn_0 494_splitncnn_1
Convolution      495                      1 1 494_splitncnn_1 495 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             497                      1 1 495 497 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 498                      1 1 497 498 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             500                      1 1 498 500 0=0.000000e+00 1=6.000000e+00
Convolution      501                      1 1 500 501 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         503                      2 1 494_splitncnn_0 501 503 0=0
Split            splitncnn_10             1 2 503 503_splitncnn_0 503_splitncnn_1
Convolution      504                      1 1 503_splitncnn_1 504 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             506                      1 1 504 506 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 507                      1 1 506 507 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             509                      1 1 507 509 0=0.000000e+00 1=6.000000e+00
Convolution      510                      1 1 509 510 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=92160
Split            splitncnn_11             1 2 510 510_splitncnn_0 510_splitncnn_1
Convolution      512                      1 1 510_splitncnn_1 512 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             514                      1 1 512 514 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 515                      1 1 514 515 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             517                      1 1 515 517 0=0.000000e+00 1=6.000000e+00
Convolution      518                      1 1 517 518 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         520                      2 1 510_splitncnn_0 518 520 0=0
Split            splitncnn_12             1 2 520 520_splitncnn_0 520_splitncnn_1
Convolution      521                      1 1 520_splitncnn_1 521 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             523                      1 1 521 523 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 524                      1 1 523 524 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             526                      1 1 524 526 0=0.000000e+00 1=6.000000e+00
Convolution      527                      1 1 526 527 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         529                      2 1 520_splitncnn_0 527 529 0=0
Convolution      530                      1 1 529 530 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             532                      1 1 530 532 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 533                      1 1 532 533 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             535                      1 1 533 535 0=0.000000e+00 1=6.000000e+00
Convolution      536                      1 1 535 536 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=307200
Convolution      538                      1 1 536 538 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=40960
ReLU             540                      1 1 538 540
Split            splitncnn_13             1 2 540 540_splitncnn_0 540_splitncnn_1
Convolution      541                      1 1 503_splitncnn_0 541 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
ReLU             543                      1 1 541 543
Interp           560                      1 1 540_splitncnn_1 560 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         561                      2 1 560 543 561 0=0
ConvolutionDepthWise 562                      1 1 561 562 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             564                      1 1 562 564
Convolution      565                      1 1 564 565 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             567                      1 1 565 567
Split            splitncnn_14             1 2 567 567_splitncnn_0 567_splitncnn_1
Convolution      568                      1 1 442_splitncnn_0 568 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             570                      1 1 568 570
Interp           587                      1 1 567_splitncnn_1 587 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         588                      2 1 587 570 588 0=0
ConvolutionDepthWise 589                      1 1 588 589 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             591                      1 1 589 591
Convolution      592                      1 1 591 592 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             594                      1 1 592 594
Split            splitncnn_15             1 2 594 594_splitncnn_0 594_splitncnn_1
Convolution      595                      1 1 416_splitncnn_0 595 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
ReLU             597                      1 1 595 597
Interp           614                      1 1 594_splitncnn_1 614 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         615                      2 1 614 597 615 0=0
ConvolutionDepthWise 616                      1 1 615 616 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             618                      1 1 616 618
Convolution      619                      1 1 618 619 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             621                      1 1 619 621
Interp           638                      1 1 594_splitncnn_0 638 0=1 1=2.000000e+00 2=2.000000e+00
Interp           649                      1 1 567_splitncnn_0 649 0=1 1=4.000000e+00 2=4.000000e+00
Interp           660                      1 1 540_splitncnn_0 660 0=1 1=8.000000e+00 2=8.000000e+00
BinaryOp         661                      2 1 621 638 661 0=0
BinaryOp         662                      2 1 661 649 662 0=0
BinaryOp         663                      2 1 662 660 663 0=0
Convolution      664                      1 1 663 664 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             666                      1 1 664 666
Convolution      667                      1 1 666 667 0=6 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
Interp           678                      1 1 667 678 0=1 1=4.000000e+00 2=4.000000e+00
Sigmoid          out                      1 1 678 out
