7767517
38 38
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 77 0=24 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=600
ReLU             Relu_1                   1 1 77 78
ConvolutionDepthWise Conv_2                   1 1 78 79 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
ReLU             Relu_3                   1 1 79 80
Convolution      Conv_4                   1 1 80 81 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Pooling          MaxPool_5                1 1 81 82 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise Conv_6                   1 1 82 83 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_8                   1 1 83 85
Convolution      Conv_9                   1 1 85 86 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ConvolutionDepthWise Conv_11                  1 1 86 88 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             Relu_12                  1 1 88 89
Convolution      Conv_13                  1 1 89 90 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Pooling          MaxPool_14               1 1 90 91 0=0 1=2 11=2 2=1 12=2 3=1 13=0 14=1 15=0 5=1
ConvolutionDepthWise Conv_15                  1 1 91 92 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             Relu_17                  1 1 92 94
Convolution      Conv_18                  1 1 94 95 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
ConvolutionDepthWise Conv_20                  1 1 95 97 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             Relu_21                  1 1 97 98
Convolution      Conv_22                  1 1 98 99 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
Pooling          MaxPool_23               1 1 99 100 0=0 1=2 11=2 2=1 12=2 3=1 13=0 14=1 15=0 5=1
ConvolutionDepthWise Conv_24                  1 1 100 101 0=512 1=2 11=2 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048 7=512
ReLU             Relu_26                  1 1 101 103
Convolution      Conv_27                  1 1 103 104 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
Reshape          Squeeze_29               1 1 104 106 0=-1 1=512 2=-233
Permute          Transpose_30             1 1 106 107 0=1
LSTM             LSTM_37                  1 1 107 234 0=128 1=524288 2=2
Permute          Transpose_38             1 1 234 237 0=2
Reshape          Reshape_40               1 1 237 239 0=-1 1=0
Reshape          Reshape_54               1 1 239 253 0=256
InnerProduct     Gemm_55                  1 1 253 254 0=256 1=1 2=65536
Reshape          Reshape_59               1 1 254 260 0=-1 1=1
LSTM             LSTM_66                  1 1 260 387 0=64 1=131072 2=2
Permute          Transpose_67             1 1 387 390 0=2
Reshape          Reshape_69               1 1 390 392 0=-1 1=0
Reshape          Reshape_83               1 1 392 406 0=128
InnerProduct     Gemm_84                  1 1 406 407 0=5530 1=1 2=707840
Reshape          Reshape_88               1 1 407 out 0=-1 1=1
