7767517
146 162
Input            input                    0 1 input
Convolution      339                      1 1 input 339 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             341                      1 1 339 341
Pooling          342                      1 1 341 342 0=0 1=3 11=3 2=2 12=1 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 342 342_splitncnn_0 342_splitncnn_1
ConvolutionDepthWise 343                      1 1 342_splitncnn_1 343 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      345                      1 1 343 345 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             347                      1 1 345 347
Convolution      348                      1 1 342_splitncnn_0 348 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             350                      1 1 348 350
ConvolutionDepthWise 351                      1 1 350 351 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      353                      1 1 351 353 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             355                      1 1 353 355
Concat           356                      2 1 347 355 356 0=0
ShuffleChannel   361                      1 1 356 361 0=2
Slice            362                      1 2 361 362 363 -23300=2,24,-233 1=0
Convolution      364                      1 1 363 364 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             366                      1 1 364 366
ConvolutionDepthWise 367                      1 1 366 367 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      369                      1 1 367 369 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             371                      1 1 369 371
Concat           372                      2 1 362 371 372 0=0
ShuffleChannel   377                      1 1 372 377 0=2
Slice            378                      1 2 377 378 379 -23300=2,24,-233 1=0
Convolution      380                      1 1 379 380 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             382                      1 1 380 382
ConvolutionDepthWise 383                      1 1 382 383 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      385                      1 1 383 385 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             387                      1 1 385 387
Concat           388                      2 1 378 387 388 0=0
ShuffleChannel   393                      1 1 388 393 0=2
Slice            394                      1 2 393 394 395 -23300=2,24,-233 1=0
Convolution      396                      1 1 395 396 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             398                      1 1 396 398
ConvolutionDepthWise 399                      1 1 398 399 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      401                      1 1 399 401 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             403                      1 1 401 403
Concat           404                      2 1 394 403 404 0=0
ShuffleChannel   409                      1 1 404 409 0=2
Split            splitncnn_1              1 2 409 409_splitncnn_0 409_splitncnn_1
ConvolutionDepthWise 410                      1 1 409_splitncnn_1 410 0=48 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      412                      1 1 410 412 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             414                      1 1 412 414
Convolution      415                      1 1 409_splitncnn_0 415 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             417                      1 1 415 417
ConvolutionDepthWise 418                      1 1 417 418 0=48 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      420                      1 1 418 420 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             422                      1 1 420 422
Concat           423                      2 1 414 422 423 0=0
ShuffleChannel   428                      1 1 423 428 0=2
Slice            429                      1 2 428 429 430 -23300=2,48,-233 1=0
Convolution      431                      1 1 430 431 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             433                      1 1 431 433
ConvolutionDepthWise 434                      1 1 433 434 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      436                      1 1 434 436 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             438                      1 1 436 438
Concat           439                      2 1 429 438 439 0=0
ShuffleChannel   444                      1 1 439 444 0=2
Slice            445                      1 2 444 445 446 -23300=2,48,-233 1=0
Convolution      447                      1 1 446 447 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             449                      1 1 447 449
ConvolutionDepthWise 450                      1 1 449 450 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      452                      1 1 450 452 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             454                      1 1 452 454
Concat           455                      2 1 445 454 455 0=0
ShuffleChannel   460                      1 1 455 460 0=2
Slice            461                      1 2 460 461 462 -23300=2,48,-233 1=0
Convolution      463                      1 1 462 463 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             465                      1 1 463 465
ConvolutionDepthWise 466                      1 1 465 466 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      468                      1 1 466 468 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             470                      1 1 468 470
Concat           471                      2 1 461 470 471 0=0
ShuffleChannel   476                      1 1 471 476 0=2
Slice            477                      1 2 476 477 478 -23300=2,48,-233 1=0
Convolution      479                      1 1 478 479 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             481                      1 1 479 481
ConvolutionDepthWise 482                      1 1 481 482 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      484                      1 1 482 484 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             486                      1 1 484 486
Concat           487                      2 1 477 486 487 0=0
ShuffleChannel   492                      1 1 487 492 0=2
Slice            493                      1 2 492 493 494 -23300=2,48,-233 1=0
Convolution      495                      1 1 494 495 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             497                      1 1 495 497
ConvolutionDepthWise 498                      1 1 497 498 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      500                      1 1 498 500 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             502                      1 1 500 502
Concat           503                      2 1 493 502 503 0=0
ShuffleChannel   508                      1 1 503 508 0=2
Slice            509                      1 2 508 509 510 -23300=2,48,-233 1=0
Convolution      511                      1 1 510 511 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             513                      1 1 511 513
ConvolutionDepthWise 514                      1 1 513 514 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      516                      1 1 514 516 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             518                      1 1 516 518
Concat           519                      2 1 509 518 519 0=0
ShuffleChannel   524                      1 1 519 524 0=2
Slice            525                      1 2 524 525 526 -23300=2,48,-233 1=0
Convolution      527                      1 1 526 527 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             529                      1 1 527 529
ConvolutionDepthWise 530                      1 1 529 530 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      532                      1 1 530 532 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             534                      1 1 532 534
Concat           535                      2 1 525 534 535 0=0
ShuffleChannel   540                      1 1 535 540 0=2
Split            splitncnn_2              1 2 540 540_splitncnn_0 540_splitncnn_1
ConvolutionDepthWise 541                      1 1 540_splitncnn_1 541 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      543                      1 1 541 543 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             545                      1 1 543 545
Convolution      546                      1 1 540_splitncnn_0 546 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             548                      1 1 546 548
ConvolutionDepthWise 549                      1 1 548 549 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      551                      1 1 549 551 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             553                      1 1 551 553
Concat           554                      2 1 545 553 554 0=0
ShuffleChannel   559                      1 1 554 559 0=2
Slice            560                      1 2 559 560 561 -23300=2,96,-233 1=0
Convolution      562                      1 1 561 562 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             564                      1 1 562 564
ConvolutionDepthWise 565                      1 1 564 565 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      567                      1 1 565 567 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             569                      1 1 567 569
Concat           570                      2 1 560 569 570 0=0
ShuffleChannel   575                      1 1 570 575 0=2
Slice            576                      1 2 575 576 577 -23300=2,96,-233 1=0
Convolution      578                      1 1 577 578 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             580                      1 1 578 580
ConvolutionDepthWise 581                      1 1 580 581 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      583                      1 1 581 583 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             585                      1 1 583 585
Concat           586                      2 1 576 585 586 0=0
ShuffleChannel   591                      1 1 586 591 0=2
Slice            592                      1 2 591 592 593 -23300=2,96,-233 1=0
Convolution      594                      1 1 593 594 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             596                      1 1 594 596
ConvolutionDepthWise 597                      1 1 596 597 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      599                      1 1 597 599 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             601                      1 1 599 601
Concat           602                      2 1 592 601 602 0=0
ShuffleChannel   607                      1 1 602 607 0=2
Convolution      608                      1 1 607 608 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=49152
ReLU             610                      1 1 608 610
Reduction        611                      1 1 610 611 0=3 1=0 -23303=2,2,3 4=0
InnerProduct     612                      1 1 611 612 0=2 1=1 2=512
Softmax          out                      1 1 612 out 0=0 1=1
