7767517
54 55
Input            input                    0 1 input
Convolution      202                      1 1 input 202 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216
ReLU             204                      1 1 202 204
ConvolutionDepthWise 205                      1 1 204 205 0=8 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             207                      1 1 205 207
Convolution      208                      1 1 207 208 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
ConvolutionDepthWise 210                      1 1 208 210 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             212                      1 1 210 212
Convolution      213                      1 1 212 213 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ConvolutionDepthWise 215                      1 1 213 215 0=16 1=3 11=3 2=1 12=1 3=1 13=2 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             217                      1 1 215 217
Convolution      218                      1 1 217 218 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ConvolutionDepthWise 220                      1 1 218 220 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             222                      1 1 220 222
Convolution      223                      1 1 222 223 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ConvolutionDepthWise 225                      1 1 223 225 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             227                      1 1 225 227
Convolution      228                      1 1 227 228 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ConvolutionDepthWise 230                      1 1 228 230 0=32 1=3 11=3 2=1 12=1 3=1 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             232                      1 1 230 232
Convolution      233                      1 1 232 233 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ConvolutionDepthWise 235                      1 1 233 235 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             237                      1 1 235 237
Convolution      238                      1 1 237 238 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ConvolutionDepthWise 240                      1 1 238 240 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             242                      1 1 240 242
Convolution      243                      1 1 242 243 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ConvolutionDepthWise 245                      1 1 243 245 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             247                      1 1 245 247
Convolution      248                      1 1 247 248 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ConvolutionDepthWise 250                      1 1 248 250 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             252                      1 1 250 252
Convolution      253                      1 1 252 253 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ConvolutionDepthWise 255                      1 1 253 255 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             257                      1 1 255 257
Convolution      258                      1 1 257 258 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ConvolutionDepthWise 260                      1 1 258 260 0=128 1=2 11=2 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512 7=128
ReLU             262                      1 1 260 262
Convolution      263                      1 1 262 263 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
Reshape          265                      1 1 263 265 0=-1 1=256 2=-233
Permute          266                      1 1 265 266 0=1
Split            splitncnn_0              1 2 266 266_splitncnn_0 266_splitncnn_1
LSTM             300                      1 1 266_splitncnn_1 300 0=48 1=49152 2=0
Squeeze          303                      1 1 300 303 -23303=1,1
LSTM             326                      1 1 303 326 0=48 1=9216 2=0
Squeeze          329                      1 1 326 329 -23303=1,1
LSTM             386                      1 1 266_splitncnn_0 386 0=48 1=98304 2=2
Reshape          391                      1 1 386 391 0=96 1=-1
LSTM             437                      1 1 391 437 0=48 1=36864 2=2
Reshape          442                      1 1 437 442 0=96 1=-1
Concat           443                      2 1 329 442 443 0=1
Reshape          457                      1 1 443 457 0=144
InnerProduct     458                      1 1 457 458 0=5532 1=1 2=796608
Reshape          out                      1 1 458 out 0=-1 1=1
