7767517
29 29
Input            input                    0 1 input
Convolution      61                       1 1 input 61 0=24 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=600
ReLU             62                       1 1 61 62
ConvolutionDepthWise 63                       1 1 62 63 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
ReLU             64                       1 1 63 64
Convolution      65                       1 1 64 65 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Pooling          66                       1 1 65 66 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise 67                       1 1 66 67 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             69                       1 1 67 69
Convolution      70                       1 1 69 70 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ConvolutionDepthWise 72                       1 1 70 72 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             73                       1 1 72 73
Convolution      74                       1 1 73 74 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
Pooling          75                       1 1 74 75 0=0 1=2 11=2 2=1 12=2 3=1 13=0 14=1 15=0 5=1
ConvolutionDepthWise 76                       1 1 75 76 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             78                       1 1 76 78
Convolution      79                       1 1 78 79 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
ConvolutionDepthWise 81                       1 1 79 81 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
ReLU             82                       1 1 81 82
Convolution      83                       1 1 82 83 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
Pooling          84                       1 1 83 84 0=0 1=2 11=2 2=1 12=2 3=1 13=0 14=1 15=0 5=1
ConvolutionDepthWise 85                       1 1 84 85 0=512 1=2 11=2 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048 7=512
ReLU             87                       1 1 85 87
Convolution      88                       1 1 87 88 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
Convolution      90                       1 1 88 90 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
Convolution      91                       1 1 90 91 0=5530 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1415680
Squeeze          92                       1 1 91 92 -23303=1,2
Permute          93                       1 1 92 93 0=1
Reshape          out                      1 1 93 out 0=5530 1=-1 2=1
