7767517
145 161
Input            input                    0 1 input
Convolution      339                      1 1 input 339 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             341                      1 1 339 341
Pooling          342                      1 1 341 342 0=0 1=3 11=3 2=2 12=1 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 342 342_splitncnn_0 342_splitncnn_1
ConvolutionDepthWise 343                      1 1 342_splitncnn_1 343 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      345                      1 1 343 345 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             347                      1 1 345 347
Convolution      348                      1 1 342_splitncnn_0 348 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             350                      1 1 348 350
ConvolutionDepthWise 351                      1 1 350 351 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      353                      1 1 351 353 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             355                      1 1 353 355
Concat           356                      2 1 347 355 356 0=0
ShuffleChannel   395                      1 1 356 395 0=2
Slice            396                      1 2 395 396 397 -23300=2,24,-233 1=0
Convolution      398                      1 1 397 398 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             400                      1 1 398 400
ConvolutionDepthWise 401                      1 1 400 401 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      403                      1 1 401 403 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             405                      1 1 403 405
Concat           406                      2 1 396 405 406 0=0
ShuffleChannel   445                      1 1 406 445 0=2
Slice            446                      1 2 445 446 447 -23300=2,24,-233 1=0
Convolution      448                      1 1 447 448 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             450                      1 1 448 450
ConvolutionDepthWise 451                      1 1 450 451 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      453                      1 1 451 453 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             455                      1 1 453 455
Concat           456                      2 1 446 455 456 0=0
ShuffleChannel   495                      1 1 456 495 0=2
Slice            496                      1 2 495 496 497 -23300=2,24,-233 1=0
Convolution      498                      1 1 497 498 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             500                      1 1 498 500
ConvolutionDepthWise 501                      1 1 500 501 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      503                      1 1 501 503 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             505                      1 1 503 505
Concat           506                      2 1 496 505 506 0=0
ShuffleChannel   545                      1 1 506 545 0=2
Split            splitncnn_1              1 2 545 545_splitncnn_0 545_splitncnn_1
ConvolutionDepthWise 546                      1 1 545_splitncnn_1 546 0=48 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      548                      1 1 546 548 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             550                      1 1 548 550
Convolution      551                      1 1 545_splitncnn_0 551 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             553                      1 1 551 553
ConvolutionDepthWise 554                      1 1 553 554 0=48 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      556                      1 1 554 556 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             558                      1 1 556 558
Concat           559                      2 1 550 558 559 0=0
ShuffleChannel   598                      1 1 559 598 0=2
Slice            599                      1 2 598 599 600 -23300=2,48,-233 1=0
Convolution      601                      1 1 600 601 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             603                      1 1 601 603
ConvolutionDepthWise 604                      1 1 603 604 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      606                      1 1 604 606 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             608                      1 1 606 608
Concat           609                      2 1 599 608 609 0=0
ShuffleChannel   648                      1 1 609 648 0=2
Slice            649                      1 2 648 649 650 -23300=2,48,-233 1=0
Convolution      651                      1 1 650 651 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             653                      1 1 651 653
ConvolutionDepthWise 654                      1 1 653 654 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      656                      1 1 654 656 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             658                      1 1 656 658
Concat           659                      2 1 649 658 659 0=0
ShuffleChannel   698                      1 1 659 698 0=2
Slice            699                      1 2 698 699 700 -23300=2,48,-233 1=0
Convolution      701                      1 1 700 701 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             703                      1 1 701 703
ConvolutionDepthWise 704                      1 1 703 704 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      706                      1 1 704 706 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             708                      1 1 706 708
Concat           709                      2 1 699 708 709 0=0
ShuffleChannel   748                      1 1 709 748 0=2
Slice            749                      1 2 748 749 750 -23300=2,48,-233 1=0
Convolution      751                      1 1 750 751 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             753                      1 1 751 753
ConvolutionDepthWise 754                      1 1 753 754 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      756                      1 1 754 756 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             758                      1 1 756 758
Concat           759                      2 1 749 758 759 0=0
ShuffleChannel   798                      1 1 759 798 0=2
Slice            799                      1 2 798 799 800 -23300=2,48,-233 1=0
Convolution      801                      1 1 800 801 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             803                      1 1 801 803
ConvolutionDepthWise 804                      1 1 803 804 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      806                      1 1 804 806 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             808                      1 1 806 808
Concat           809                      2 1 799 808 809 0=0
ShuffleChannel   848                      1 1 809 848 0=2
Slice            849                      1 2 848 849 850 -23300=2,48,-233 1=0
Convolution      851                      1 1 850 851 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             853                      1 1 851 853
ConvolutionDepthWise 854                      1 1 853 854 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      856                      1 1 854 856 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             858                      1 1 856 858
Concat           859                      2 1 849 858 859 0=0
ShuffleChannel   898                      1 1 859 898 0=2
Slice            899                      1 2 898 899 900 -23300=2,48,-233 1=0
Convolution      901                      1 1 900 901 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             903                      1 1 901 903
ConvolutionDepthWise 904                      1 1 903 904 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      906                      1 1 904 906 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             908                      1 1 906 908
Concat           909                      2 1 899 908 909 0=0
ShuffleChannel   948                      1 1 909 948 0=2
Split            splitncnn_2              1 2 948 948_splitncnn_0 948_splitncnn_1
ConvolutionDepthWise 949                      1 1 948_splitncnn_1 949 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      951                      1 1 949 951 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             953                      1 1 951 953
Convolution      954                      1 1 948_splitncnn_0 954 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             956                      1 1 954 956
ConvolutionDepthWise 957                      1 1 956 957 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      959                      1 1 957 959 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             961                      1 1 959 961
Concat           962                      2 1 953 961 962 0=0
ShuffleChannel   1001                     1 1 962 1001 0=2
Slice            1002                     1 2 1001 1002 1003 -23300=2,96,-233 1=0
Convolution      1004                     1 1 1003 1004 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             1006                     1 1 1004 1006
ConvolutionDepthWise 1007                     1 1 1006 1007 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      1009                     1 1 1007 1009 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             1011                     1 1 1009 1011
Concat           1012                     2 1 1002 1011 1012 0=0
ShuffleChannel   1051                     1 1 1012 1051 0=2
Slice            1052                     1 2 1051 1052 1053 -23300=2,96,-233 1=0
Convolution      1054                     1 1 1053 1054 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             1056                     1 1 1054 1056
ConvolutionDepthWise 1057                     1 1 1056 1057 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      1059                     1 1 1057 1059 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             1061                     1 1 1059 1061
Concat           1062                     2 1 1052 1061 1062 0=0
ShuffleChannel   1101                     1 1 1062 1101 0=2
Slice            1102                     1 2 1101 1102 1103 -23300=2,96,-233 1=0
Convolution      1104                     1 1 1103 1104 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             1106                     1 1 1104 1106
ConvolutionDepthWise 1107                     1 1 1106 1107 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      1109                     1 1 1107 1109 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             1111                     1 1 1109 1111
Concat           1112                     2 1 1102 1111 1112 0=0
ShuffleChannel   1151                     1 1 1112 1151 0=2
Convolution      1152                     1 1 1151 1152 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=196608
ReLU             1154                     1 1 1152 1154
Reduction        1155                     1 1 1154 1155 0=3 1=0 -23303=2,2,3 4=0
InnerProduct     out                      1 1 1155 out 0=4 1=1 2=4096
